; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	spectrograph1 - mode
	infrared0 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	Star1 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 spectrograph1)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph2)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument10 spectrograph3)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 Star6)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 spectrograph1)
	(supports instrument11 spectrograph2)
	(supports instrument11 spectrograph3)
	(calibration_target instrument11 Star6)
	(supports instrument12 spectrograph3)
	(supports instrument12 spectrograph1)
	(supports instrument12 infrared0)
	(calibration_target instrument12 Star6)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
)
(:goal (and
	(pointing satellite3 Star8)
	(pointing satellite4 Star4)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 spectrograph3)
	(have_image Star9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 spectrograph2)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 spectrograph3)
))

)

; plan
1. (turn_to satellite4 star4 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star4)
   goals met: 1 of 9
2. (turn_to satellite3 groundstation2 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation2)
   goals met: 1 of 9
3. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 1 of 9
4. (calibrate satellite3 instrument9 groundstation2)
   added: (calibrated instrument9)
   goals met: 1 of 9
5. (turn_to satellite3 star13 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star13)
   goals met: 1 of 9
6. (take_image satellite3 star13 instrument9 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 2 of 9
7. (turn_to satellite3 star11 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star11)
   goals met: 2 of 9
8. (take_image satellite3 star11 instrument9 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 3 of 9
9. (turn_to satellite3 phenomenon7 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 phenomenon7)
   goals met: 3 of 9
10. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 3 of 9
11. (take_image satellite3 phenomenon7 instrument9 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 4 of 9
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 4 of 9
13. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 9
14. (turn_to satellite1 phenomenon12 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 9
15. (take_image satellite1 phenomenon12 instrument1 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 5 of 9
16. (turn_to satellite1 star10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star10)
   goals met: 5 of 9
17. (take_image satellite1 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 9
18. (turn_to satellite1 star9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star9)
   goals met: 6 of 9
19. (take_image satellite1 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 7 of 9
20. (turn_to satellite3 star8 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star8)
   goals met: 8 of 9
21. (take_image satellite3 star8 instrument9 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 9 of 9
